/**
 * Вася и Маша участвуют в субботнике и красят стволы деревьев в белый цвет.
 * Деревья растут вдоль улицы через равные промежутки в 1 метр. Одно из деревьев
 * обозначено числом ноль, деревья по одну сторону занумерованы положительными числами
 * 1, 2 и т. д., а в другую — отрицательными -1, -2 и т. д.
 *
 * Ведро с краской для Васи установили возле дерева P, а для Маши — возле дерева Q.
 * Ведра с краской очень тяжелые и Вася с Машей не могут их переставить, поэтому они
 * окунают кисть в ведро и уже с этой кистью идут красить дерево. Краска на кисти из ведра Васи
 * засыхает, когда он удаляется от ведра более чем на V метров, а из ведра Маши — на M метров.
 * Определите, сколько деревьев может быть покрашено.
 *
 * Формат ввода:
 * В первой строке (массиве) содержится два целых числа P и V — номер дерева, у которого стоит
 * ведро Васи и на сколько деревьев он может от него удаляться.
 *
 * В второй строке (массиве) содержится два целых числа Q и M — аналогичные данные для Маши.
 * Все числа целые и по модулю не превосходят 10^8
 *
 * Формат вывода:
 * Выведите одно число — количество деревьев, которые могут быть покрашены.
 *
 * Пример:
 * Ввод:
 * [0, 7], [12, 5]
 *
 * Вывод:
 * 25
 */

const paintedTree = (arr1, arr2) => {
  const min1 = arr1[0] - arr1[1]; // -7
  const max1 = arr1[0] + arr1[1]; // 7
  const min2 = arr2[0] - arr2[1]; // 7
  const max2 = arr2[0] + arr2[1]; // 17

  if (Math.max(min1, min2) <= Math.min(max1, max2)) {
    return Math.max(max1, max2) - Math.min(min1, min2) + 1;
  } else {
    return max1 - min1 + 1 + (max2 - min2 + 1);
  }
};

console.log(paintedTree([0, 7], [12, 5])); // 25
console.log(paintedTree([-3, 2], [-5, 1])); // 6
console.log(paintedTree([0, 0], [0, 0])); // 1
console.log(paintedTree([3, 2], [10, 3])); // 1
